import os

# 项目根目录
BASE_DIR = os.path.dirname(os.path.abspath(__file__))

# POI 数据文件路径
POI_DATA_PATH = os.path.join(BASE_DIR, 'data', 'poi.json')

# 高德地图 API Key
AMAP_JS_KEY = 'cef04be82ff504c6478e314bedcff919'    # Web端 JS API
AMAP_WEB_KEY = '53dfc38a8185e0d8ffe8c17a2e0e2a9c'  # Web服务

# 地图默认中心点（根据实际校区调整）
MAP_CENTER = [103.988471, 30.581856]  # 成信大航空港校区中心
MAP_ZOOM = 16

# 校区边界轮廓坐标 [lng, lat]
CAMPUS_BOUNDARY = [
    [103.984298, 30.57835],
    [103.986012, 30.578621],
    [103.989706, 30.5793],
    [103.992405, 30.579775],
    [103.994247, 30.580156],
    [103.993804, 30.581768],
    [103.993292, 30.583557],
    [103.993055, 30.584236],
    [103.992888, 30.584354],
    [103.992258, 30.584863],
    [103.990169, 30.58449],
    [103.987106, 30.584914],
    [103.985667, 30.584795],
    [103.983348, 30.583362],
    [103.983535, 30.583014],
    [103.983215, 30.582779],
    [103.98297, 30.582565],
    [103.983257, 30.582197],
    [103.98315, 30.582076],
    [103.983557, 30.581505],
    [103.983782, 30.580482],
    [103.983995, 30.579438],
]

# Flask
DEBUG = True
SECRET_KEY = 'campus-nav-dev-key'
